In [68]:

import pandas as pd
import regex as re
from IPython.display import display
from  sqlalchemy  import create_engine , text
import os

### DOWNLOAD FOLDER

In [69]:
#!gdown --folder https://drive.google.com/drive/folders/19hj5MAu95OyZBC5ATPxlgL8IC-V3v11I

### PATHES

In [155]:
def make_paths(data_dir = r"DataSources" ):

# Root directory where your CSV files exist
   

  path_data = {
    "brands":     os.path.join(data_dir, "brands.csv"),
    "categories": os.path.join(data_dir, "categories.csv"),
    "customers":  os.path.join(data_dir, "customers.csv"),
    "order_items": os.path.join(data_dir, "order_items.csv"),
    "orders":     os.path.join(data_dir, "orders.csv"),
    "products":   os.path.join(data_dir, "products.csv"),
    "staffs":     os.path.join(data_dir, "staffs.csv"),
    "stocks":     os.path.join(data_dir, "stocks.csv"),
    "stores":     os.path.join(data_dir, "stores.csv"),
  }
  return  path_data


paths = make_paths()

## loades and df for data

In [156]:
def load_dataframe(path_data):
   dfs = {}   

   for name, path in path_data.items():
       dfs[name] = pd.read_csv(path)
       
   return dfs

dfs = load_dataframe(paths)

## Shapes

In [157]:
def show_shapes():
    """Display shape of each DataFrame"""
    for name, df in dfs.items():
        print(f"{name} ___ ROWS : {df.shape[0]} , COLUMNS : {df.shape[1]}")

In [158]:
show_shapes()

brands ___ ROWS : 9 , COLUMNS : 2
categories ___ ROWS : 7 , COLUMNS : 2
customers ___ ROWS : 1445 , COLUMNS : 9
order_items ___ ROWS : 4764 , COLUMNS : 6
orders ___ ROWS : 1615 , COLUMNS : 8
products ___ ROWS : 334 , COLUMNS : 6
staffs ___ ROWS : 10 , COLUMNS : 8
stocks ___ ROWS : 939 , COLUMNS : 3
stores ___ ROWS : 3 , COLUMNS : 8

In [159]:
def info_data():
 for name, df in dfs.items():
    display(f"{name} ___  : {df.info()} ")

info_data()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   brand_id    9 non-null      int64
 1   brand_name  9 non-null      object
dtypes: int64(1), object(1)
memory usage: 276.0+ bytes

'brands ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    7 non-null      int64
 1   category_name  7 non-null      object
dtypes: int64(1), object(1)
memory usage: 244.0+ bytes

'categories ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1445 entries, 0 to 1444
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  1445 non-null   int64
 1   first_name   1445 non-null   object
 2   last_name    1445 non-null   object
 3   phone        178 non-null    object
 4   email        1445 non-null   object
 5   street       1445 non-null   object
 6   city         1445 non-null   object
 7   state        1445 non-null   object
 8   zip_code     1445 non-null   int64
dtypes: int64(2), object(7)
memory usage: 101.7+ KB

'customers ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4764 entries, 0 to 4763
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    4764 non-null   int64
 1   item_id     4764 non-null   object
 2   product_id  4764 non-null   int64
 3   quantity    4764 non-null   int64
 4   list_price  4764 non-null   float64
 5   discount    4764 non-null   float64
dtypes: float64(2), int64(3), object(1)
memory usage: 223.4+ KB

'order_items ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1615 entries, 0 to 1614
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       1615 non-null   int64
 1   customer_id    1615 non-null   int64
 2   order_status   1615 non-null   int64
 3   order_date     1615 non-null   object
 4   required_date  1615 non-null   object
 5   shipped_date   1445 non-null   object
 6   store_id       1615 non-null   int64
 7   staff_id       1615 non-null   int64
dtypes: int64(5), object(3)
memory usage: 101.1+ KB

'orders ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 334 entries, 0 to 333
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    334 non-null    int64
 1   product_name  334 non-null    object
 2   brand_id      334 non-null    int64
 3   category_id   334 non-null    int64
 4   model_year    334 non-null    int64
 5   list_price    334 non-null    float64
dtypes: float64(1), int64(4), object(1)
memory usage: 15.8+ KB

'products ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   staff_id    10 non-null     int64
 1   first_name  10 non-null     object
 2   last_name   9 non-null      object
 3   email       9 non-null      object
 4   phone       8 non-null      object
 5   active      10 non-null     int64
 6   store_id    9 non-null      float64
 7   manager_id  9 non-null      float64
dtypes: float64(2), int64(2), object(4)
memory usage: 772.0+ bytes

'staffs ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 939 entries, 0 to 938
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    939 non-null    int64
 1   product_id  939 non-null    int64
 2   quantity    939 non-null    int64
dtypes: int64(3)
memory usage: 22.1 KB

'stocks ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    3 non-null      int64
 1   store_name  3 non-null      object
 2   phone       3 non-null      object
 3   email       2 non-null      object
 4   street      3 non-null      object
 5   city        3 non-null      object
 6   state       3 non-null      object
 7   zip_code    2 non-null      float64
dtypes: float64(1), int64(1), object(6)
memory usage: 324.0+ bytes

'stores ___  : None '

## show data

In [160]:

def show_three_row():
 for name, df in dfs.items():
    print(f"\n{name}")
    display(df.head(3))

show_three_row()

brands

   brand_id brand_name
0         1    Electra
1         2       Haro
2         3     Heller

categories

   category_id      category_name
0            1  Children Bicycles
1            2   Comfort Bicycles
2            3  Cruisers Bicycles

customers

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code
0,1,Debra,Burks,NaN,debra.burks@yahoo.com,9273 Thorne Ave.,Orchard Park,NY,14127
1,2,Kasha,Todd,NaN,kasha.todd@yahoo.com,910 Vine Street,Campbell,CA,95008
2,3,Tameka,Fisher,NaN,tameka.fisher@aol.com,769C Honey Creek St.,Redondo Beach,CA,90278

order_items

   order_id item_id  product_id  quantity  list_price  discount
0         1       1          20         1      599.99      0.20
1         1       2           8         2     1799.99      0.07
2         1       3          10         2     1549.00      0.05

orders

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7

products

,product_id,product_name,brand_id,category_id,model_year,list_price
0,1,Trek 820 - 2016,9,6,2016,379.99
1,2,Ritchey Timberwolf Frameset - 2016,5,6,2016,749.99
2,3,Surly Wednesday Frameset - 2016,8,6,2016,999.99

staffs

,staff_id,first_name,last_name,email,phone,active,store_id,manager_id
0,1,Fabiola,Jackson,fabiola.jackson@bikes.shop,NaN,1,NaN,NaN
1,2,Mireya,NaN,mireya.copeland@bikes.shop,(831) 555-5555,1,1.0,1.0
2,3,Genna,Serrano,genna.serrano@bikes.shop,(831) 555-5556,1,1.0,2.0

stocks

   store_id  product_id  quantity
0         1           1        27
1         1           2         5
2         1           3         6

stores

,store_id,store_name,phone,email,street,city,state,zip_code
0,1,Santa Cruz Bikes,(831) 476-4321,NaN,3700 Portola Drive,Santa Cruz,CA,NaN
1,2,Baldwin Bikes,(516) 379-8888,baldwin@bikes.shop,4200 Chestnut Lane,Baldwin,NY,11432.0
2,3,Rowlett Bikes,(972) 530-5555,rowlett@bikes.shop,8000 Fairway Avenue,Rowlett,TX,75088.0

## modify words

In [161]:
def clean_text_columns(df):
    text_cols = df.select_dtypes(include="object").columns

    df[text_cols] = (
        df[text_cols].apply(lambda col:col.str.lower()
                                        .str.strip()
                                       .str.replace(" ", "_", regex=False)
            )
    )
    return df

In [162]:
def clean_address(series):
    return (
        series.str.lower()
              .str.replace(" ", "_", regex=False)
              .str.replace(r"[^\w\s]", "", regex=True) # delete . 
              .str.replace(r"_+$", "", regex=True)  #delete final _
    )

In [163]:
# it handle all phone and fill miss
def clean_phone(series):
    return (
        series.fillna("unknown") # handle missing
              .astype(str)
              .str.replace(r"[^\d]", "", regex=True)  #delete characters
              .replace("","unknown")  # if the num is char only and become empty to fill
              
    )

In [164]:
def remove_negative(series):
    return(
        
        series[series>=0]
    )

In [165]:

for name, df in dfs.items():
    df = clean_text_columns(df)

    if name == "customers" and "street"    in df.columns:
        df["street"] = clean_address(df["street"])
        
    if name == "products" and "product_name"   in df.columns:
        df["product_name"] = clean_address(df["product_name"]).str.replace(r"_+", "_", regex=True)
        
    if name == "staffs" and "phone" in df.columns:
        df["phone"] = clean_phone(df["phone"] )
        
    if name == "stores" and "phone" in df.columns:
        df["phone"] = clean_phone(df["phone"] )
        
    if name == "customers" and "phone" in df.columns:
        df["phone"] = clean_phone(df["phone"] )
        
    if name == "order_items" and "quantity" in df.columns:
        df["quantity"] = remove_negative(df["quantity"] )
    
    if name == "stocks" and "quantity" in df.columns:
        df["quantity"] = remove_negative(df["quantity"] )  
        
    dfs[name] = df

In [166]:
show_three_row()

brands

   brand_id brand_name
0         1    electra
1         2       haro
2         3     heller

categories

   category_id      category_name
0            1  children_bicycles
1            2   comfort_bicycles
2            3  cruisers_bicycles

customers

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code
0,1,debra,burks,unknown,debra.burks@yahoo.com,9273_thorne_ave,orchard_park,ny,14127
1,2,kasha,todd,unknown,kasha.todd@yahoo.com,910_vine_street,campbell,ca,95008
2,3,tameka,fisher,unknown,tameka.fisher@aol.com,769c_honey_creek_st,redondo_beach,ca,90278

order_items

   order_id item_id  product_id  quantity  list_price  discount
0         1       1          20         1      599.99      0.20
1         1       2           8         2     1799.99      0.07
2         1       3          10         2     1549.00      0.05

orders

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7

products

,product_id,product_name,brand_id,category_id,model_year,list_price
0,1,trek_820_2016,9,6,2016,379.99
1,2,ritchey_timberwolf_frameset_2016,5,6,2016,749.99
2,3,surly_wednesday_frameset_2016,8,6,2016,999.99

staffs

,staff_id,first_name,last_name,email,phone,active,store_id,manager_id
0,1,fabiola,jackson,fabiola.jackson@bikes.shop,unknown,1,NaN,NaN
1,2,mireya,NaN,mireya.copeland@bikes.shop,8315555555,1,1.0,1.0
2,3,genna,serrano,genna.serrano@bikes.shop,8315555556,1,1.0,2.0

stocks

   store_id  product_id  quantity
0         1           1        27
1         1           2         5
2         1           3         6

stores

,store_id,store_name,phone,email,street,city,state,zip_code
0,1,santa_cruz_bikes,8314764321,NaN,3700_portola_drive,santa_cruz,ca,NaN
1,2,baldwin_bikes,5163798888,baldwin@bikes.shop,4200_chestnut_lane,baldwin,ny,11432.0
2,3,rowlett_bikes,9725305555,rowlett@bikes.shop,8000_fairway_avenue,rowlett,tx,75088.0

# MISSING

In [167]:
def show_missing():
  for name, df in dfs.items():
    null_count = df.isna().sum()                
    total_null = null_count.sum()               
    
    if total_null > 0:
        print(f"{name}: Total missing = {total_null}")
        print(null_count[null_count > 0])      
  if total_null == 0:
    print("NOT have missing value")
show_missing()

orders: Total missing = 170
shipped_date    170
dtype: int64
staffs: Total missing = 4
last_name     1
email         1
store_id      1
manager_id    1
dtype: int64
stores: Total missing = 2
email       1
zip_code    1
dtype: int64

In [168]:
 
# convert to datetime and handle missing data by default date 
date_cols = ['order_date' , 'required_date' , 'shipped_date']
for col in date_cols:
   dfs['orders'][col] = pd.to_datetime(dfs['orders'][col], errors='coerce')
   
dfs['orders'] = dfs['orders'].fillna(pd.Timestamp("2080-01-01"))

# fill stores
cols_miss_stores =['email']
dfs['stores'][cols_miss_stores] = dfs['stores'][cols_miss_stores].fillna("unknown" )

dfs['stores']['zip_code'] = dfs['stores']['zip_code'].fillna(-1 )


#staffs
str_cols_miss =['email'	, 'last_name' ]
dfs['staffs'][str_cols_miss] = dfs['staffs'][str_cols_miss].fillna("unknown" )

In [169]:
show_missing()  # this employee it is havent manager it propaply he is new staf or old satf or ceo

staffs: Total missing = 2
store_id      1
manager_id    1
dtype: int64
NOT have missing value

## Duplicates

In [170]:
def num_duplicated():
 for name , df in dfs.items():
   if  df.duplicated().any():
     print(name)
     print(df.duplicated().sum())
    
 
num_duplicated()

order_items
34
products
13

In [171]:
def drop_duplicate():
    dfs['order_items'] = dfs['order_items'].drop_duplicates()
    dfs['products']=dfs['products'].drop_duplicates()
    
    
drop_duplicate()

In [172]:
num_duplicated()

#  Data Types

In [173]:

    

dfs['stores']['zip_code'] = dfs['stores']['zip_code'].astype(int)


### convert active to bool
dfs['staffs']['active'] = dfs['staffs']['active'].astype(bool)

dfs['staffs']['store_id ']   = dfs['staffs']['store_id'].astype('Int64')
dfs['staffs']['manager_id'] = dfs['staffs']['manager_id'].astype('Int64')

In [174]:
info_data()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   brand_id    9 non-null      int64
 1   brand_name  9 non-null      object
dtypes: int64(1), object(1)
memory usage: 276.0+ bytes

'brands ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    7 non-null      int64
 1   category_name  7 non-null      object
dtypes: int64(1), object(1)
memory usage: 244.0+ bytes

'categories ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1445 entries, 0 to 1444
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  1445 non-null   int64
 1   first_name   1445 non-null   object
 2   last_name    1445 non-null   object
 3   phone        1445 non-null   object
 4   email        1445 non-null   object
 5   street       1445 non-null   object
 6   city         1445 non-null   object
 7   state        1445 non-null   object
 8   zip_code     1445 non-null   int64
dtypes: int64(2), object(7)
memory usage: 101.7+ KB

'customers ___  : None '

<class 'pandas.core.frame.DataFrame'>
Index: 4730 entries, 0 to 4763
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    4730 non-null   int64
 1   item_id     4730 non-null   object
 2   product_id  4730 non-null   int64
 3   quantity    4730 non-null   int64
 4   list_price  4730 non-null   float64
 5   discount    4730 non-null   float64
dtypes: float64(2), int64(3), object(1)
memory usage: 258.7+ KB

'order_items ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1615 entries, 0 to 1614
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       1615 non-null   int64
 1   customer_id    1615 non-null   int64
 2   order_status   1615 non-null   int64
 3   order_date     1615 non-null   datetime64[ns]
 4   required_date  1615 non-null   datetime64[ns]
 5   shipped_date   1615 non-null   datetime64[ns]
 6   store_id       1615 non-null   int64
 7   staff_id       1615 non-null   int64
dtypes: datetime64[ns](3), int64(5)
memory usage: 101.1 KB

'orders ___  : None '

<class 'pandas.core.frame.DataFrame'>
Index: 321 entries, 0 to 333
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    321 non-null    int64
 1   product_name  321 non-null    object
 2   brand_id      321 non-null    int64
 3   category_id   321 non-null    int64
 4   model_year    321 non-null    int64
 5   list_price    321 non-null    float64
dtypes: float64(1), int64(4), object(1)
memory usage: 17.6+ KB

'products ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   staff_id    10 non-null     int64
 1   first_name  10 non-null     object
 2   last_name   10 non-null     object
 3   email       10 non-null     object
 4   phone       10 non-null     object
 5   active      10 non-null     bool
 6   store_id    9 non-null      float64
 7   manager_id  9 non-null      Int64
 8   store_id    9 non-null      Int64
dtypes: Int64(2), bool(1), float64(1), int64(1), object(4)
memory usage: 802.0+ bytes

'staffs ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 939 entries, 0 to 938
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    939 non-null    int64
 1   product_id  939 non-null    int64
 2   quantity    939 non-null    int64
dtypes: int64(3)
memory usage: 22.1 KB

'stocks ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    3 non-null      int64
 1   store_name  3 non-null      object
 2   phone       3 non-null      object
 3   email       3 non-null      object
 4   street      3 non-null      object
 5   city        3 non-null      object
 6   state       3 non-null      object
 7   zip_code    3 non-null      int64
dtypes: int64(2), object(6)
memory usage: 324.0+ bytes

'stores ___  : None '

#  Data Transformation

## Merge products with brands and categories to reduce joins

In [175]:

temp_df = dfs['products'].merge(dfs['brands'], on='brand_id', how='inner')
products = temp_df.merge(dfs['categories'], on='category_id', how='inner')

In [176]:
tables = ['staffs' , 'customers']
for table in tables :
    df = dfs[table]
    df['full_name'] = df['first_name'] + '_' + df['last_name']
        
    dfs[table] = df

In [177]:
df = dfs['order_items']
#Calculate total price per order item
df.loc[:, 'total_price'] = (df['list_price'] * df['quantity'] * (1 - df['discount'])).round(2) 

df_order_total_amount  =( df.groupby(by='order_id').agg(
    counts_items=('item_id', 'count') , 
    sums_money = (('total_price' , 'sum'))
    )
                          ).round(2).reset_index()




dfs['order_totals'] = df_order_total_amount

In [153]:
dfs['order_totals'].head()

   order_id  counts_items  sums_money
0         1             5    10231.04
1         2             2     1697.97
2         3             2     1519.98
3         4             1     1349.98
4         5             3     3900.06

In [178]:
show_three_row()

brands

   brand_id brand_name
0         1    electra
1         2       haro
2         3     heller

categories

   category_id      category_name
0            1  children_bicycles
1            2   comfort_bicycles
2            3  cruisers_bicycles

customers

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code,full_name
0,1,debra,burks,unknown,debra.burks@yahoo.com,9273_thorne_ave,orchard_park,ny,14127,debra_burks
1,2,kasha,todd,unknown,kasha.todd@yahoo.com,910_vine_street,campbell,ca,95008,kasha_todd
2,3,tameka,fisher,unknown,tameka.fisher@aol.com,769c_honey_creek_st,redondo_beach,ca,90278,tameka_fisher

order_items

   order_id item_id  product_id  quantity  list_price  discount  total_price
0         1       1          20         1      599.99      0.20       479.99
1         1       2           8         2     1799.99      0.07      3347.98
2         1       3          10         2     1549.00      0.05      2943.10

orders

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7

products

,product_id,product_name,brand_id,category_id,model_year,list_price
0,1,trek_820_2016,9,6,2016,379.99
1,2,ritchey_timberwolf_frameset_2016,5,6,2016,749.99
2,3,surly_wednesday_frameset_2016,8,6,2016,999.99

staffs

,staff_id,first_name,last_name,email,phone,active,store_id,manager_id,store_id,full_name
0,1,fabiola,jackson,fabiola.jackson@bikes.shop,unknown,True,NaN,<NA>,<NA>,fabiola_jackson
1,2,mireya,unknown,mireya.copeland@bikes.shop,8315555555,True,1.0,1,1,mireya_unknown
2,3,genna,serrano,genna.serrano@bikes.shop,8315555556,True,1.0,2,1,genna_serrano

stocks

   store_id  product_id  quantity
0         1           1        27
1         1           2         5
2         1           3         6

stores

,store_id,store_name,phone,email,street,city,state,zip_code
0,1,santa_cruz_bikes,8314764321,unknown,3700_portola_drive,santa_cruz,ca,-1
1,2,baldwin_bikes,5163798888,baldwin@bikes.shop,4200_chestnut_lane,baldwin,ny,11432
2,3,rowlett_bikes,9725305555,rowlett@bikes.shop,8000_fairway_avenue,rowlett,tx,75088

order_totals

   order_id  counts_items  sums_money
0         1             5    10231.04
1         2             2     1697.97
2         3             2     1519.98

## checking

In [179]:
for name, df in dfs.items():
    display(f"{name} ___  : {df.info()} ")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   brand_id    9 non-null      int64
 1   brand_name  9 non-null      object
dtypes: int64(1), object(1)
memory usage: 276.0+ bytes

'brands ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    7 non-null      int64
 1   category_name  7 non-null      object
dtypes: int64(1), object(1)
memory usage: 244.0+ bytes

'categories ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1445 entries, 0 to 1444
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  1445 non-null   int64
 1   first_name   1445 non-null   object
 2   last_name    1445 non-null   object
 3   phone        1445 non-null   object
 4   email        1445 non-null   object
 5   street       1445 non-null   object
 6   city         1445 non-null   object
 7   state        1445 non-null   object
 8   zip_code     1445 non-null   int64
 9   full_name    1445 non-null   object
dtypes: int64(2), object(8)
memory usage: 113.0+ KB

'customers ___  : None '

<class 'pandas.core.frame.DataFrame'>
Index: 4730 entries, 0 to 4763
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     4730 non-null   int64
 1   item_id      4730 non-null   object
 2   product_id   4730 non-null   int64
 3   quantity     4730 non-null   int64
 4   list_price   4730 non-null   float64
 5   discount     4730 non-null   float64
 6   total_price  4730 non-null   float64
dtypes: float64(3), int64(3), object(1)
memory usage: 295.6+ KB

'order_items ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1615 entries, 0 to 1614
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       1615 non-null   int64
 1   customer_id    1615 non-null   int64
 2   order_status   1615 non-null   int64
 3   order_date     1615 non-null   datetime64[ns]
 4   required_date  1615 non-null   datetime64[ns]
 5   shipped_date   1615 non-null   datetime64[ns]
 6   store_id       1615 non-null   int64
 7   staff_id       1615 non-null   int64
dtypes: datetime64[ns](3), int64(5)
memory usage: 101.1 KB

'orders ___  : None '

<class 'pandas.core.frame.DataFrame'>
Index: 321 entries, 0 to 333
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    321 non-null    int64
 1   product_name  321 non-null    object
 2   brand_id      321 non-null    int64
 3   category_id   321 non-null    int64
 4   model_year    321 non-null    int64
 5   list_price    321 non-null    float64
dtypes: float64(1), int64(4), object(1)
memory usage: 17.6+ KB

'products ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   staff_id    10 non-null     int64
 1   first_name  10 non-null     object
 2   last_name   10 non-null     object
 3   email       10 non-null     object
 4   phone       10 non-null     object
 5   active      10 non-null     bool
 6   store_id    9 non-null      float64
 7   manager_id  9 non-null      Int64
 8   store_id    9 non-null      Int64
 9   full_name   10 non-null     object
dtypes: Int64(2), bool(1), float64(1), int64(1), object(5)
memory usage: 882.0+ bytes

'staffs ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 939 entries, 0 to 938
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    939 non-null    int64
 1   product_id  939 non-null    int64
 2   quantity    939 non-null    int64
dtypes: int64(3)
memory usage: 22.1 KB

'stocks ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    3 non-null      int64
 1   store_name  3 non-null      object
 2   phone       3 non-null      object
 3   email       3 non-null      object
 4   street      3 non-null      object
 5   city        3 non-null      object
 6   state       3 non-null      object
 7   zip_code    3 non-null      int64
dtypes: int64(2), object(6)
memory usage: 324.0+ bytes

'stores ___  : None '

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1615 entries, 0 to 1614
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1615 non-null   int64
 1   counts_items  1615 non-null   int64
 2   sums_money    1615 non-null   float64
dtypes: float64(1), int64(2)
memory usage: 38.0 KB

'order_totals ___  : None '

In [180]:
def save_cleaned_data(dfs):
    output_dir = "cleaned_data"
    os.makedirs(output_dir, exist_ok=True)
    
    for name, df in dfs.items():
        file_path = os.path.join(output_dir, f"{name}.csv")
        df.to_csv(file_path, index=False)
        print(f"Saved {name} to {file_path}")

In [181]:
save_cleaned_data(dfs)

Saved brands to cleaned_data\brands.csv
Saved categories to cleaned_data\categories.csv
Saved customers to cleaned_data\customers.csv
Saved order_items to cleaned_data\order_items.csv
Saved orders to cleaned_data\orders.csv
Saved products to cleaned_data\products.csv
Saved staffs to cleaned_data\staffs.csv
Saved stocks to cleaned_data\stocks.csv
Saved stores to cleaned_data\stores.csv
Saved order_totals to cleaned_data\order_totals.csv

# connect database

In [182]:
connection_string = (
  "mssql+pyodbc://SOSO:1234@localhost/Retaill_DB"
  "?driver=ODBC+Driver+17+for+SQL+Server"
)
engine = create_engine(connection_string)

In [ ]:
dfs['brands'].to_sql("Brands", if_exists="append", con=engine , index=False)

dfs['categories'].to_sql("Categories", if_exists="append", con=engine , index=False)

dfs['stores'].to_sql("Stores", if_exists="append", con=engine , index=False)

In [ ]:
dfs['customers'].to_sql("Customers", if_exists="append", con=engine , index=False)
dfs['staffs'].to_sql("Staffs", con=engine, if_exists="append", index=False)

In [ ]:
products.to_sql("Products", if_exists="append", con=engine , index=False)
dfs['orders'].to_sql("Orders", if_exists="append", con=engine , index=False)

In [ ]:

dfs['order_items'].to_sql("OrderItems", if_exists="append", con=engine , index=False)
dfs['stocks'].to_sql("Stocks", if_exists="append", con=engine , index=False)

In [ ]:
dfs['order_totals'].to_sql("OrderTotals", if_exists="append", con=engine , index=False)

In [183]:
pd.read_sql("SELECT  * FROM Stocks " , con=engine)

     store_id  product_id  quantity
0           1           1        27
1           1           2         5
2           1           3         6
3           1           4        23
4           1           5        22
..        ...         ...       ...
934         3         309        30
935         3         310         8
936         3         311        23
937         3         312        18
938         3         313         0

[939 rows x 3 columns]

In [186]:
import pandas as pd
import os

folder_path = r"F:\DE_Final\analysis1"

dfs_output = {}

for file_name in os.listdir(folder_path):
    if file_name.endswith(".csv"):
        file_path = os.path.join(folder_path, file_name)
        df_name = os.path.splitext(file_name)[0] 
        df = pd.read_csv(file_path)
        dfs[df_name] = df
        
        
        print(f"DataFrame: {df_name}")
        display(df.head(3))  
        display(len(df))
        print("\n")

DataFrame:  Average_spending

   customer_id       full_name  avg_spending
0           19  lizzette_stein     451839.20
1          730   andria_rivers     432702.54
2         1226   qiana_jackson     198805.01

1445

DataFrame:  Best_staff

   staff_id      full_name  total_sales
0         7  venita_daniel   3275794.92

1

DataFrame:  Products_low_stock

   product_id                   product_name  quantity_product
0         175  trek_domane_slr_frameset_2018                 5
1         289    electra_superbolt_1_20_2018                 9
2         220  electra_cruiser_1_ladies_2018                10

15

DataFrame:  Revenue_category

   category_id      category_name  Revenue_Category
0            6     mountain_bikes        3037506.31
1            7         road_bikes        1911626.98
2            3  cruisers_bicycles        1357703.34

7

DataFrame:  Revenue_store

   store_id        store_name     Revenue
0         2     baldwin_bikes  6101245.93
1         1  santa_cruz_bikes  1608972.69
2         3     rowlett_bikes  1302865.97

3

DataFrame:  Staff_Performance

   staff_id        full_name  Count_order
0         6  marcelene_boyer          553
1         7    venita_daniel          540
2         3    genna_serrano          184

6

DataFrame:  Stores_inventory

   store_id        store_name  quantity_product
0         3     rowlett_bikes              4620
1         1  santa_cruz_bikes              4532
2         2     baldwin_bikes              4359

3

DataFrame:  top_customers_spending

   customer_id       full_name   spending
0           19  lizzette_stein  451839.20
1          730   andria_rivers  432702.54
2         1226   qiana_jackson  198805.01

5

DataFrame: Customers_no_orders

Empty DataFrame
Columns: [full_name, order_id]
Index: []

0

DataFrame: Monthly_sales

   years  months  Revenue_Month
0   2016       1       184750.0
1   2016       2       156112.0
2   2016       3       180600.0

36

DataFrame: Top_products

   product_id                         product_name  quantity_product
0           6  surly_ice_cream_truck_frameset_2016               167
1          13        electra_cruiser_1_24inch_2016               157
2          16   electra_townie_original_7d_eq_2016               156

10

In [188]:
import pandas as pd
import os
import json

# input folder (CSV files)
csv_folder = r"F:\DE_Final\analysis1"

# output json file
output_json = r"F:\DE_Final\frontend_data.json"

data_for_frontend = {}

for file_name in os.listdir(csv_folder):
    if file_name.endswith(".csv"):
        file_path = os.path.join(csv_folder, file_name)
        table_name = os.path.splitext(file_name)[0]

        df = pd.read_csv(file_path , nrows = 50)

        # convert dataframe to list of dicts
        data_for_frontend[table_name] = df.to_dict(orient="records")

        print(f"Loaded: {table_name}")

# write one json file
with open(output_json, "w", encoding="utf-8") as f:
    json.dump(data_for_frontend, f, indent=4, ensure_ascii=False)

Loaded:  Average_spending
Loaded:  Best_staff
Loaded:  Products_low_stock
Loaded:  Revenue_category
Loaded:  Revenue_store
Loaded:  Staff_Performance
Loaded:  Stores_inventory
Loaded:  top_customers_spending
Loaded: Customers_no_orders
Loaded: Monthly_sales
Loaded: Top_products